<template>

  <div class="agreementOfAgent">
    <!--<p class="head">合同编号：&lt;!&ndash;<span class="number">xxxxxxxx</span>&ndash;&gt;</p>-->
    <!--<h1 style="text-align: center">入驻合同书</h1>-->
    <!--<p>甲方： 店家</p>-->
    <!--<p>乙方：平台商</p>-->
    <!--<br>-->
    <br>
    <p class="bold">感谢使用“汇米城”（以下简称“平台”）。</p>
    <p class="indent">商户合作业务协议（以下简称“本协议”）是广州市启盛商户服务有限公司（以下简称“我们”）与平台用户（以下简称“您”）就<span class="col-bold"> 启盛新零售”项目</span>“业务合作（以下简称“项目”）及平台服务相关事宜所订立。本协议有助于您了解我们为您提供的服务内容及您的权利义务，请您知悉阅读，对于尤为重要的条款，我们予以<span class="col-bold">加粗</span>，以特别提醒您加以注意</p>
    <!--<p class="bold">第一、合作内容</p>-->
    <p class="indent">您使用平台服务、通过网络页面点击确认或以其他方式接受本协议，即视为您已经充分理解本协议所有条款，并同意与我们订立本协议。</p>
    <p class="indent">如您在同意订立本协议之前，对本协议内容存在疑虑或异议的，请您联系我们，以便我们为您进行解释和说明，使您能够充分理解，从而帮助您自主决定是否接受本协议及是否使用我们的服务。</p>

    <p class="indent">一、相关定义及合作内容</p>
    <!--<p class="indent">1、“启盛新零售”项目是通过数字化技术和人工智能，赋能实体店，通过线上营销、线下加盟的方式，引导消费者进入实体店消费，每笔消费金额均将按照相应比例折算出积分，消费者可根据需要在项目对应的线上商城中将积分兑换成所需商品的一种全新的零售服务/平台。</p>-->
    <!--<p class="bold">第二、双方的权力和义务</p>-->
    <p class="indent">1、“启盛新零售”项目是通过数字化技术和人工智能，赋能实体店，通过线上营销、线下加盟的方式，引导消费者进入实体店消费，每笔消费金额均将按照相应比例折算出积分，消费者可根据需要在项目对应的线上商城中将积分兑换成所需商品的一种全新的零售服务/平台。</p>
    <p class="indent">2.甲方委托乙方提供技术服务时，应如实向乙方提供相关经营资质资料，甲方应保证所提交的上述资料的准确性、真实性、完整性和有效性。甲方的资质材料信息发生任何变更，或迁址、停业、变更域名或联系电话等资料信息，应提前通知乙方，否则，乙方有权视具体情况暂停服务，甲方未及时通知导致的一切投诉和纠纷以及因此产生的一切法律责任，均由甲方承担。</p>
    <p class="indent">3、使用平台服务，您需向我们支付对应之服务费用。</p>

    <p class="indent">二、声明与承诺</p>
    <p class="bold">1、您登陆平台后发出的指令将视为您本人所为，所以特别提醒您，请妥善保管登陆的认证要素，不要将其提供给任何第三方或交于任何第三方使用。</p>
    <p class="bold">为提高服务安全性，我们可能采取必要手段对您进行身份验证，并据此决定对您提供相关服务。</p>
    <p class="bold">2、您承诺不为任何非法目的或以任何非法方式使用本平台服务，并承诺遵守中国相关法律、法规及互联网之使用惯例。如我们发现或经第三方举报并经核实您存在前述行为或情形的，我们可能或暂停或终止部分或全部平台服务，并视需要报告监管部门，并可能依法移送司法机关。</p>
    <p class="bold">3、您同意并授权我们直接或通过第三方机构（第三方支付机构、银行）等从您的资金渠道上扣划我们应当享有的服务费用款项。您同意并授权第三方机构（第三方支付机构、银行）根据我们的指令进行相应操作，且第三方机构不因前述操作对您承担任何责任。</p>
    <p class="bold">4、您承诺对由您上传、寄送或以其他方式提供的资料、信息、文件享有合法权利，未侵犯也不会侵犯任何其他方的合法权利或权益（包括隐私权、商标权、专利权等）。</p>


    <!--<p class="bold">第三、违约责任</p>-->
    <p class="indent">三、平台服务</p>
    <p class="indent">1、我们严格按照法律法规的规定为您提供本协议项下之服务，并可为您提供必要之协助，包括但不限于培训、标识张贴及维护等服务。</p>
    <p class="indent">2、为有效提升您的竞争力，我们为您及您的客户提供消费积分兑换礼品服务，即当您的客户在您处成功消费后，根据相关规则及流程，您的客户有权在我们提供的线上商城兑换相应礼品。</p>
    <p class="indent">3、我们在履行本协议过程中，应当确保所提供之线上商城具有安全性、稳定性及合法有效性；若商城需要调整及优化或其他影响正常使用的，我们应当提前2个工作日通知您。</p>
    <p class="indent">4、根据业务需要，我们为您委托合法有效的收单机构为您提供银行卡收单服务。您加入该项目后，您有权享受该项目的权益之一，即收单机构提供的“0元”费率的收单服务。</p>
    <p class="indent">5、我们仅为您提供积分兑换、委托收单机构提供银行卡收单等服务，若您与您的客户或其他主体之间发生的非因我们原因产生之纠纷的，应当由您自行处理。</p>
    <p class="indent">四、您的权利义务</p>
    <p class="indent">1、<span class="col-bold">您应当确保有签署及履行本协议之资格和资质</span>，在签署本协议时，向我们或我们委托的其他方提供相关的经营资质文件等。您应当承诺所提供的资质文件均为真实有效且合法完整的，<span class="col-bold">若所提交之资料出现任何变更的，您应当及时通知我们，若因您未通知或未及时通知给我们造成损害的，您应当承担损害赔偿责任。</span></p>
    <!--<p class="indent">（7）违反本协议或法律法规的强制性规定的。</p>-->
    <p class="bold">2、根据您的需要，我们可为您在线上商城开通交易查询账号，便于您查询交易信息及或提供相关信息管理等。您对该账户、密码或验证码应当进行妥善保管，对因账号和密码的遗失、泄露或将验证码随意泄露所造成的损害，由您自行承担。</p>
    <p class="indent"><span class="col-bold">3、您应当确保您的经营是合法有效的，提供之产品/服务是符合国家及或行业标准的，不得损害客户及或其他方之合法权益，若因此产生的损害均由您自行承担。</span>您处理非因我们原因产生的纠纷的，不得以任何方式包括语言或其他等方式将纠纷当事方引至我们或我们关联方或我们监管方等，若因此给我们造成损害的，我们有权终止协议并就造成的损害向您追偿。</p>
    <p class="bold">4、若您被中国银联等监管机构认定为风险类商户或禁入类商户的，我们有权解除本协议，且不承担任何责任。</p>
    <p class="bold">5、您应当妥善保管我们或我们代理商张贴的标识，并确保标识的完整、清晰和整洁。在本协议合作期间，您承诺不得将标识放置在客户无法接触的地方，一经发现，我们有权以【 200 元】/次要求您承担违约责任。</p>
    <p class="bold">6、在本协议合作期间，您应当如实向客户宣传本项目，并积极指导客户正确使用积分兑换商城，若因您不实宣传或指导给客户造成损害的，由您自行承担损害赔偿责任。</p>
    <p class="bold">7、您不得以任何形式损害我们之权益，包括但不限于虚假宣传等，若因此给我们造成损害的，我们有权终止本协议并要求您承担损害赔偿责任。</p>

    <p class="indent">四、服务费用</p>
    <p class="indent">1、我们为您提供本协议项下之服务的，您应当向我们支付服务费用，服务费用标准如下：</p>
    <div style="padding:15px;">
      <x-table full-bordered style="background-color:#fff;">
        <thead>
        <tr>
          <th><span class="col-bold">科目</span></th>
          <th><span class="col-bold">收费标准</span></th>
          <th><span class="col-bold">备注</span></th>
        </tr>
        </thead>
        <tbody>
        <tr>
          <td>新零售VIP能量包售价（元/套）</td>
          <td>1998元/套或以代理商报价为准</td>
          <td>
            <p class="no-indent"><span class="col-bold">能量包包含的权益（有效期为1年）</span>如下:</p>
            <p class="no-indent">1、收单交易手续费=0元；</p>
            <p class="no-indent">2、为您的客户提供可供兑换的商城礼品；</p>
            <p class="no-indent">3、一人次的价值8888元的8小时的高级营销课程一次。</p>
            <p class="no-indent">4、价值6800元的促销活动策划及上架一次</p>
          </td>
          <!--<td colspan="2">$1.25 x 10</td>-->
        </tr>
        <tr>
          <td>服务费比例</td>
          <td>30%</td>
          <td>您每月成功交易的交易量占比</td>
        </tr>
        <tr>
          <td>采购定金比例</td>
          <td>100%</td>
          <td>您在采购时应向我们支付能量包之全款</td>
        </tr>
        <tr>
          <td>培训费（次）</td>
          <td>8888元/人</td>
          <td>若您另有需要，可在本能量包之外向我们另行购</td>
        </tr>
        <tr>
          <td>知名商城促销活动上架（次）</td>
          <td>6800元/次</td>
          <td>买此类服务，具体事宜可另行协商。</td>
        </tr>
        </tbody>
      </x-table>
    </div>

    <p class="indent">2、本协议双方各自依法承担因本协议约定之工作而产生的一切税费。</p>
    <p class="indent">3、本协议双方确认，如因国家政策、市场原因等调整而促使相关业务收费价格必须进行调整的，我们应及时将调整原因及调整方案通知您，您在10个工作日内对调整后的方案进行协商确认，任何一方未在期限内予以答复的视为接受该调整，按调整后的标准执行。如协商不能达成一致的，双方均有权终止本协议（应妥善完成相应的工作交接），双方互不承担违约责任。</p>

    <p class="bold">五、退货要求</p>
    <p class="bold">1、积分兑换服务对应的产品（若您提供的是服务，该类型不支持任何形式的退换）原则上不支持退换货，但若经您同意确有必要退换货的，亦仅支持退货并且应当按照如下规则办理退货：</p>
    <p class="bold">（1）仅退您自有产品/服务，不退商城积分兑换之产品：</p>
    <p class="bold">（i）您可提供自有产品/服务的换货服务；（ii）若必须退货的，我们建议退款金额为您自有产品/服务交易金额的一部分。您不论以任何比例退还客户价款的，均不得要求我们予以赔偿。</p>
    <p class="bold">（2）既退还您自有产品/服务的，亦退还商城积分兑换之产品：</p>
    <p class="bold">（i）您应当确保该客户将商城积分所兑换的产品退回至我们或我们指定地点，我们收到所退产品后，我们将就该笔交易享有的收益退回至您（若有）。若我们未收到所退产品的，我们有权不予退回所应享有之收益，若收益不能弥补我们之损害的，我们将有权采取扣除您交易金额等方式向您追偿。</p>

    <p class="indent">六、违约责任</p>
    <p class="indent">1、任何一方违反本协议之约定，应当向另一方承担损害赔偿责任（本协议项下之损害赔偿责任包括直接损失和间接损失，以及维权费用（包括但不限于律师费、诉讼费、差旅费等））。</p>
    <p class="bold">2、您有下列情形之一，我们有权单方面解除本协议并要求您承担损害赔偿责任:</p>
    <p class="indent">（1）无证经营或经营行为/经营内容不符合国家法律/市场监管的要求及或所提供之产品/服务不符合国家或行业标准的；</p>
    <p class="indent">（2）出现违规操作，经我们/我们委托的其他方指出拒不纠正的；</p>
    <p class="indent">（3）无理拒绝或故意拖延金融机构或其他机构的查询和监查要求的；</p>
    <p class="indent">（5）违反本协议或利用我们及或我们合作的其他方提供的服务从事非法业务的；</p>
    <p class="indent">（6）因您自身原因出现风险事件或者经我们及或我们委托的支付机构判断交易异常的；</p>
    <p class="indent">（7）实施其他有损我们利益行为的/违反本协议或法律法规或监管部门等的强制性规定的。</p>


    <p class="bold">七、免责条款</p>
    <p class="bold">1、鉴于网络和电子商务之特殊属性，发生包括但不限于下列任何影响网络或本协议所指服务正常经营之情形导致我们不能履行本合同下义务的，我们可以免责：</p>
    <p class="bold">（1）电信部门技术调整导致之重大影响；</p>
    <p class="bold">（2）因政府管制而造成的暂时性关闭等；</p>
    <p class="bold">（3）因国家法律法规、政策、银行政策调整影响本服务无法正常履行；</p>
    <p class="bold">（4）电信运营商等非各方原因造成本协议无法继续履行或需做变更的；</p>

    <p class="bold">八、纠纷解决</p>
    <p class="bold">1、 本协议的效力、解释、变更、执行及争议解决均适用中华人民共和国法律。</p>
    <p class="bold">2、因本协议产生的任何争议，双方应协商解决；双方确认，因本协议引起的或与本协议有关的全部争议，由被告所在的法院提起诉讼。</p>


    <p class="indent">九、其他</p>
    <p class="bold">1、本协议有效期为【 一年 】，自您使用平台服务、通过网络页面点击确认或以其他方式接受本协议。</p>
    <p class="indent">2、我们与您及双方的全部员工必须对其因履行本协议而知悉的一方的商业信息及客户信息等予以严格保密，不得以任何形式泄露给第三方。</p>
    <p class="bold">3、 涉及本协议内容修改或变更的，我们将在平台上以公告的形式告知您，公告发布之日起第5个自然日后协议生效。若您不同意修改或变更本协议的，则应当立即停止使用本平台服务，否则，视为您同意并接受修改或变更后的协议。</p>
    <p class="indent">4、如本协议任何条款被法院、仲裁机构或其他争议解决机构宣布为无效或无法执行，则该条款被视为从本协议中删除，而本协议的其他条款仍然完全有效。</p>
    <p class="indent">5、您知悉并同意，协议签署及履行过程中，我们制定及调整之适用于本协议的管理办法和规章制度，应视为为本协议不可分割之组成部分，与本协议具有同等法律效力。</p>
    <p class="indent">6、本协议未尽之事宜，由双方协商处理，或者按照国家有关法律、法规的规定执行。</p>








    <br>
    <!--<div class="FootDiv">-->
      <!--<p><span>甲&nbsp;&nbsp;&nbsp;&nbsp;方： </span></p>-->
      <!--<p><span>乙&nbsp;&nbsp;&nbsp;&nbsp;方：</span></p>-->
    <!--</div>-->
    <!--<div class="FootDiv">-->
      <!--<p><span>甲方代表：</span></p>-->
      <!--<p><span>乙方代表：</span></p>-->
    <!--</div>-->
    <!--<div class="FootDiv">-->
      <!--<p><span>日&nbsp;&nbsp;&nbsp;&nbsp;期： </span></p>-->
      <!--<p><span>日&nbsp;&nbsp;&nbsp;&nbsp;期： </span></p>-->
    <!--</div>-->
  </div>

</template>

<script>
  import { XTable } from 'vux'
  export default {
    name: 'agreementOfAgent3',
    components: {
      XTable
    },
    data() {
      return {}
    },
    created() {

    },
    methods: {}
  }
</script>

<style rel="stylesheet/scss" lang="scss">

  @import "../../styles/default.css";
  .col-bold {
    font-weight: bold;
  }
  h3 {
    *font-size: 2.375rem;
  }

  h3, h4 {
    *padding: 1.125rem 0;
    *margin: 1rem 0;
  }

  h5 {
    text-align: left;
    font-size: 1.5rem;
  }

  .agreementOfAgent {
    padding: 1rem  1rem 5rem;
    .head{
      text-align: right;
      font-weight: bold;
      font-size: 1.25rem;
      .number{
        color: #F33945;
      }
    }
    p {
      text-align: left;
      font-size: 1.5rem;
      margin: 0.5em;
      &.indent {
        text-indent: 2em;
      }

      &.bold {
        text-indent: 2em;
        font-weight: bold;
      }

    }
    .FootDiv{
      display: flex;
      align-items: center;
      justify-content: space-between;
      >p{
        flex: 1;
      }
    }
  }
</style>
